# TitleblockBadViewType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..TitleblockBadViewType Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Titleblocks can only be placed on sheets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TitleblockBadViewType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TitleblockBadViewType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TitleblockBadViewType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace